scr1c/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>емайл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>77</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяФормированияТокена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ссылкаНаВосстановлениеПароля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктивныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доверенность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекБанк</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаБлокировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогБлокировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

scr1c/Catalogs/Контрагенты/Ext/ManagerModule.bsl
Функция НайтиКонтрагентаПоемайл(емайл,пароль=неопределено) Экспорт   
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("емайл",НРЕГ(СокрЛП(емайл)));
	Запрос.УстановитьПараметр("пароль",пароль);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	(Контрагенты.пароль = &пароль или &пароль=неопределено)
	               | и	Контрагенты.емайл = &емайл"; 
	
	Выб = Запрос.Выполнить().Выбрать();
	Если выб.Следующий() Тогда
		Возврат выб.ссылка;
	ИНаче
		Возврат Неопределено;
	КонецЕсли;
	
	
	
КонецФункции   


Функция НайтиКонтрагентаПоLink(Link) Экспорт   
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ссылкаНаВосстановлениеПароля",Link);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	(Контрагенты.пароль = &пароль или &пароль=неопределено)
	               | и	Контрагенты.емайл = &емайл"; 
	
	Выб = Запрос.Выполнить().Выбрать();
	Если выб.Следующий() Тогда
		Возврат выб.ссылка;
	ИНаче
		Возврат Неопределено;
	КонецЕсли;
	
	
	
КонецФункции   

Функция НайтиКонтрагентаПоТокену(Токен) Экспорт   
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Токен",Токен);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Токен = &Токен
	               | "; 
	
	Выб = Запрос.Выполнить().Выбрать();
	Если выб.Следующий() Тогда
		Возврат выб.ссылка;
	ИНаче
		Возврат Неопределено;
	КонецЕсли;
	
	
	
КонецФункции

Функция СведенияОЮрФизЛице(ссКа,Дт) Экспорт
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Ссылка",ссКА);
	Запрос.Текст ="ВЫБРАТЬ
	              |	Контрагенты.Наименование КАК Наименование,
	              |	Контрагенты.Наименование КАК полнИмя,
	              |	Контрагенты.Наименование КАК НазваниеОрганизации,
	              |	Контрагенты.код КАК ИНН,
	              |	Контрагенты.КПП КАК КПП,
	              |	Контрагенты.ЮридическийАдрес КАК ЮридическийАдрес,
	              |	Контрагенты.РекБанк КАК РекБанк,
	              |	Контрагенты.Должность КАК Должность,
	              |	Контрагенты.Руководитель КАК ФИОкратко,
	              |	Контрагенты.Доверенность КАК Доверенность,
	              |	Контрагенты.Телефон КАК Телефон
	              |ИЗ
	              |	Справочник.Контрагенты КАК Контрагенты
	              |ГДЕ
	              |	Контрагенты.Ссылка = &Ссылка"; 
	
	Рез = Новый Структура();
	Тбл = Запрос.Выполнить().Выгрузить(); 
	
	Для каждого Кол из тбл.Колонки Цикл
		Рез.Вставить(кол.имя,"");
	КонецЦикла;
	
	ДЛя каждого Стр из Тбл Цикл
		ЗаполнитьЗначенияСвойств(Рез,Стр);	
		прервать;
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

Процедура ОбновитьДанныеКонтрагента(ссКА) Экспорт
	
	Стк = Новый Структура("ид",ссКА.УникальныйИдентификатор());
	
	РезСтк = глОбщий.ДанныеАПИ("KADATA",Стк);
	
	Обк = ссКА.ПолучитьОбъект();
	ЗаполнитьЗначенияСвойств(Обк,резСтк);
	ЗаписатьРеквизит(обк.Должность,резСтк.РукКАДлж);
	ЗаписатьРеквизит(обк.ДолжностьРП,резСтк.РукКАДлжРП);
	ЗаписатьРеквизит(обк.Руководитель,резСтк.РукКА);
	ЗаписатьРеквизит(обк.РуководительРП,резСтк.РукКАРП);
	ЗаписатьРеквизит(обк.Доверенность,резСтк.РукКАОсн);

	
	обк.Записать();
	
КонецПроцедуры  

Процедура ЗаписатьРеквизит(Рек,зн)
	Если ЗначениеЗаполнено(зн)=Ложь Тогда Возврат; Конецесли;
	
	Рек = Зн;
	
КонецПроцедуры
